Revit 2027 API
ExportPatternTable.GetExportPatternInfo Method
 Gets a copy of the pattern info associated to the input pattern key.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportPatternInfo GetExportPatternInfo(
	ExportPatternKey exportPatternKey
)
Public Function GetExportPatternInfo (
	exportPatternKey As ExportPatternKey
) As ExportPatternInfo
public:
ExportPatternInfo^ GetExportPatternInfo(
	ExportPatternKey^ exportPatternKey
)
member GetExportPatternInfo :
        exportPatternKey : ExportPatternKey -> ExportPatternInfo
Parameters
exportPatternKey ExportPatternKey
 The export pattern Key.
Return Value
ExportPatternInfo
 Return the patternInfo for this key.
Exceptions
Exception | Condition
ArgumentException |  An entry with the given key is not present in the table.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportPatternTable Class
Autodesk.Revit.DB Namespace